Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
    // 4. Pre-énfasis - modificar respuesta en frecuencia (cuarto)
#if ENABLE_PREEMPHASIS
    output = apply_preemphasis(output);
#endif

    // 5. AGC - control de ganancia (siempre al final)
#if ENABLE_AGC
    output = apply_agc(output);
#endif

    return output;
}

// Función para procesar una ventana FFT con overlap (Welch)
void process_welch_window(void) {
    // Extraer una ventana del buffer circular y aplicar procesamiento completo
    for (int i = 0; i < FFT_SIZE; i++) {
        int circular_index = (circular_buffer_write_index - FFT_SIZE + i + CIRCULAR_BUFFER_SIZE) % CIRCULAR_BUFFER_SIZE;
        float32_t sample = (float32_t)circular_pcm_buffer[circular_index];
        
        // Aplicar todos los filtros de procesamiento
        sample = process_sample(sample);
        
        fft_input_f32[i] = sample * hann_window[i];
    }
    
    // Calcular RFFT
    arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);
    
    float32_t current_power_val;
    
    // Bin 0 (DC)
    current_power_val = fft_output_f32[0] * fft_output_f32[0];
    accumulated_psd[0] += current_power_val;
    
    // Bins 1 a (FFT_SIZE / 2) - 1
    for (int k = 1; k < FFT_SIZE / 2; k++) {
        float32_t real_part = fft_output_f32[2*k];
        float32_t imag_part = fft_output_f32[2*k+1];
        current_power_val = (real_part * real_part) + (imag_part * imag_part);
        accumulated_psd[k] += current_power_val;
    }
    
    welch_frame_count++;
}

// Función para procesar una ventana FFT sin overlap (Bartlett)
void process_bartlett_window(int16_t* pcm_buffer) {
    // Aplicar ventana rectangular y procesamiento completo
    for (int i = 0; i < FFT_SIZE; i++) {
        float32_t sample = (float32_t)pcm_buffer[i];
        
        // Aplicar todos los filtros de procesamiento
        sample = process_sample(sample);
        
        fft_input_f32[i] = sample;
    }
    
    // Calcular RFFT
    arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);
    
    float32_t current_power_val;
    
    // Bin 0 (DC)
    current_power_val = fft_output_f32[0] * fft_output_f32[0];
    accumulated_psd[0] += current_power_val;
    
    // Bins 1 a (FFT_SIZE / 2) - 1
    for (int k = 1; k < FFT_SIZE / 2; k++) {
        float32_t real_part = fft_output_f32[2*k];
        float32_t imag_part = fft_output_f32[2*k+1];
        current_power_val = (real_part * real_part) + (imag_part * imag_part);
        accumulated_psd[k] += current_power_val;
    }
    
    bartlett_frame_count++;
}

// Función para procesar periodograma con ventana seleccionada
void process_periodogram_window(int16_t* pcm_buffer) {
    // Aplicar la ventana seleccionada y procesamiento completo
    for (int i = 0; i < FFT_SIZE; i++) {
        float32_t sample = (float32_t)pcm_buffer[i];
        
        // Aplicar todos los filtros de procesamiento
        sample = process_sample(sample);
        
        // Aplicar ventana seleccionada
        switch(PERIODOGRAM_WINDOW_TYPE) {
            case 0: // Ventana rectangular (sin ventana)
                fft_input_f32[i] = sample;
                break;
            case 1: // Ventana Hann
                fft_input_f32[i] = sample * hann_window[i];
                break;
            case 2: // Ventana Hamming
                fft_input_f32[i] = sample * hamming_window[i];
                break;
            default: // Por defecto usar rectangular
                fft_input_f32[i] = sample;
                break;
        }
    }
    
    // Calcular RFFT
    arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);
    
    float32_t current_power_val;
    
    // Bin 0 (DC)
    current_power_val = fft_output_f32[0] * fft_output_f32[0];
    periodogram_psd[0] = current_power_val;
    
    // Bins 1 a (FFT_SIZE / 2) - 1
    for (int k = 1; k < FFT_SIZE / 2; k++) {
        float32_t real_part = fft_output_f32[2*k];
        float32_t imag_part = fft_output_f32[2*k+1];
        current_power_val = (real_part * real_part) + (imag_part * imag_part);
        periodogram_psd[k] = current_power_val;
    }
}

// Función para agregar nuevas muestras al buffer circular
void add_samples_to_circular_buffer(int16_t* new_samples, uint16_t num_samples) {
    for (uint16_t i = 0; i < num_samples; i++) {
        circular_pcm_buffer[circular_buffer_write_index] = new_samples[i];
        circular_buffer_write_index = (circular_buffer_write_index + 1) % CIRCULAR_BUFFER_SIZE;
        
        if (samples_in_circular_buffer < CIRCULAR_BUFFER_SIZE) {
            samples_in_circular_buffer++;
        }
    }
}

// Función común para enviar resultados de PSD
void send_psd_results(uint32_t num_averages) {
    int uart_len = 0;
    float32_t avg_power, db_val;

    // Enviar SOF
    uart_len = sprintf(uart_tx_buffer, "SOF\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    uart_len = 0;

    for (int k = 0; k < FFT_SIZE / 2; k++) {
        avg_power = accumulated_psd[k] / num_averages;

        if (avg_power < EPSILON) {
            db_val = DB_FLOOR;
        } else {
            db_val = 10.0f * log10f(avg_power);
            if (db_val < DB_FLOOR) {
                db_val = DB_FLOOR;
            }
        }
        uart_len += sprintf(uart_tx_buffer + uart_len, "%.2f\r\n", db_val);

        if (uart_len > (UART_BUFFER_SIZE - 20) || k == (FFT_SIZE / 2) - 1) {
            if (uart_len > 0) {
                HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
                uart_len = 0;
            }
        }
    }
    if (uart_len > 0) { // Enviar cualquier remanente
        HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    }

    // Resetear acumuladores
    memset(accumulated_psd, 0, sizeof(accumulated_psd));
}

// Función específica para enviar resultados del periodograma (sin promediado)
void send_periodogram_results(void) {
    int uart_len = 0;
    float32_t db_val;

    // Enviar SOF
    uart_len = sprintf(uart_tx_buffer, "SOF\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    uart_len = 0;

