Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
    for (int k = 0; k < FFT_SIZE / 2; k++) {
        if (periodogram_psd[k] < EPSILON) {
            db_val = DB_FLOOR;
        } else {
            db_val = 10.0f * log10f(periodogram_psd[k]);
            if (db_val < DB_FLOOR) {
                db_val = DB_FLOOR;
            }
        }
        uart_len += sprintf(uart_tx_buffer + uart_len, "%.2f\r\n", db_val);

        if (uart_len > (UART_BUFFER_SIZE - 20) || k == (FFT_SIZE / 2) - 1) {
            if (uart_len > 0) {
                HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
                uart_len = 0;
            }
        }
    }
    if (uart_len > 0) { // Enviar cualquier remanente
        HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    }
}

// Función para alternar entre métodos PSD
void toggle_psd_method(void) {
    current_psd_method = (current_psd_method + 1) % 3; // Ciclar entre 0, 1, 2
    method_change_flag = 1;
}

// Función para resetear variables según el método actual
void reset_psd_variables(void) {
    // Limpiar acumuladores comunes
    memset(accumulated_psd, 0, sizeof(accumulated_psd));
    memset(periodogram_psd, 0, sizeof(periodogram_psd));
    
    // Resetear todos los filtros de procesamiento
#if ENABLE_DC_FILTER
    reset_dc_filter();
#endif

#if ENABLE_HPF_FILTER
    reset_hpf_filter();
#endif

#if ENABLE_PREEMPHASIS
    reset_preemphasis();
#endif

#if ENABLE_AGC
    reset_agc();
#endif

#if ENABLE_NOTCH_FILTER
    reset_notch_filter();
#endif
    
    // Resetear variables específicas según el método
    switch(current_psd_method) {
        case WELCH:
            memset(circular_pcm_buffer, 0, sizeof(circular_pcm_buffer));
            welch_frame_count = 0;
            circular_buffer_write_index = 0;
            samples_in_circular_buffer = 0;
            break;
            
        case BARTLETT:
            bartlett_frame_count = 0;
            break;
            
        case PERIODOGRAM:
            // No necesita reseteo especial
            break;
    }
    
    // Enviar notificación del cambio de método por UART
    const char* method_names[] = {"WELCH", "BARTLETT", "PERIODOGRAM"};
    int uart_len = sprintf(uart_tx_buffer, "METHOD_CHANGED:%s\r\n", method_names[current_psd_method]);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	  uint16_t pdm_buffer_offset_uint16 = 0;
	  uint16_t pcm_mono_buffer_offset = 0;

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2S2_Init();
  MX_CRC_Init();
  MX_PDM2PCM_Init();
  MX_USART2_UART_Init();
  MX_SPI1_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  	  init_hann_window();
  	  init_hamming_window();

    // Inicializar FFT
    if (arm_rfft_fast_init_f32(&fft_instance, FFT_SIZE) != ARM_MATH_SUCCESS) {
        Error_Handler();
    }
    
    // Inicializar filtros de procesamiento
    int uart_len = 0;
#if ENABLE_HPF_FILTER
    init_hpf_filter();
    uart_len = sprintf(uart_tx_buffer, "HPF inicializado: fc=%.1f Hz, orden=%d\r\n", HPF_CUTOFF_HZ, HPF_ORDER);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
#endif

#if ENABLE_NOTCH_FILTER
    init_notch_filter();
    uart_len = sprintf(uart_tx_buffer, "Filtro Notch inicializado: fc=%.1f Hz, Q=%.1f\r\n", NOTCH_FREQ_HZ, NOTCH_Q_FACTOR);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
#endif
    
    // Inicializar variables comunes
    memset(accumulated_psd, 0, sizeof(accumulated_psd));
    memset(periodogram_psd, 0, sizeof(periodogram_psd));
    
    // Inicializar según el método seleccionado
    switch(current_psd_method) {
        case WELCH:
            memset(circular_pcm_buffer, 0, sizeof(circular_pcm_buffer));
            welch_frame_count = 0;
            circular_buffer_write_index = 0;
            samples_in_circular_buffer = 0;
            break;
            
        case BARTLETT:
            bartlett_frame_count = 0;
            break;
            
        case PERIODOGRAM:
            // No necesita inicialización especial
            break;
    }
    
    // Iniciar DMA I2S2 para PDM
    if (HAL_I2S_Receive_DMA(&hi2s2, (uint16_t *)pdm_raw_buffer, PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16 * 2) != HAL_OK) {
      Error_Handler();
    }
    pdm_input_buffer_idx = 2; // Ningún buffer PDM listo
    
    // Enviar mensaje inicial del método activo
    const char* method_names[] = {"WELCH", "BARTLETT", "PERIODOGRAM"};
    uart_len = sprintf(uart_tx_buffer, "INITIAL_METHOD:%s\r\n", method_names[current_psd_method]);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  // Verificar si se ha solicitado un cambio de método
	  if (method_change_flag) {
		  method_change_flag = 0;
		  reset_psd_variables();
	  }
	  	
	  if (pdm_input_buffer_idx != 2) { // Un buffer PDM (un frame FFT) está listo
	        uint16_t* current_pdm_input_half_ptr;

	        if (pdm_input_buffer_idx == 0) {
	          current_pdm_input_half_ptr = pdm_raw_buffer[0];
	        } else { // pdm_input_buffer_idx == 1
	          current_pdm_input_half_ptr = pdm_raw_buffer[1];
	        }

	        //  Convertir el frame PDM completo a PCM MONO en pcm_mono_fft_input_buffer
	        pdm_buffer_offset_uint16 = 0;
	        pcm_mono_buffer_offset = 0;
	        for (int i = 0; i < NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME; i++) {
	          if (MX_PDM2PCM_Process(
	                  current_pdm_input_half_ptr + pdm_buffer_offset_uint16,
	                  (uint16_t*)(pcm_mono_fft_input_buffer + pcm_mono_buffer_offset)
	               ) != 0) {
	          }
	          pdm_buffer_offset_uint16 += (PDM_BYTES_PER_PROCESS_CALL / 2U);
	          pcm_mono_buffer_offset += PDM_SAMPLES_PER_PDM_LIB_CALL;
	        }

	        // Procesar según el método seleccionado dinámicamente
	        switch(current_psd_method) {
	            case WELCH: {
	                // Agregar las nuevas muestras al buffer circular
	                add_samples_to_circular_buffer(pcm_mono_fft_input_buffer, PCM_MONO_SAMPLES_PER_FFT_FRAME);
	                
