Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
	                // Procesar ventanas con overlap si tenemos suficientes muestras
	                if (samples_in_circular_buffer >= FFT_SIZE) {
	                    // Verificar si podemos procesar una nueva ventana (hop_size muestras desde la última)
	                    static uint16_t samples_since_last_window = 0;
	                    samples_since_last_window += PCM_MONO_SAMPLES_PER_FFT_FRAME;
	                    
	                    if (samples_since_last_window >= WELCH_HOP_SIZE) {
	                        process_welch_window();
	                        samples_since_last_window -= WELCH_HOP_SIZE;
	                        
	                        // Enviar resultados cuando tengamos suficientes promedios
	                        if (welch_frame_count >= WELCH_NUM_AVERAGES) {
	                            send_psd_results(WELCH_NUM_AVERAGES);
	                            welch_frame_count = 0;
	                        }
	                    }
	                }
	                break;
	            }
	            
	            case BARTLETT: {
	                // Procesar directamente la ventana completa (sin overlap)
	                process_bartlett_window(pcm_mono_fft_input_buffer);
	                
	                // Enviar resultados cuando tengamos suficientes promedios
	                if (bartlett_frame_count >= BARTLETT_NUM_AVERAGES) {
	                    send_psd_results(BARTLETT_NUM_AVERAGES);
	                    bartlett_frame_count = 0;
	                }
	                break;
	            }
	            
	            case PERIODOGRAM: {
	                // Procesar directamente la ventana con la ventana seleccionada
	                process_periodogram_window(pcm_mono_fft_input_buffer);
	                
	                // Enviar resultados inmediatamente (sin promediado)
	                send_periodogram_results();
	                break;
	            }
	            
	            default:
	                // No hacer nada si el método no es válido
	                break;
	        }

	        pdm_input_buffer_idx = 2;
	  } else{
		  HAL_Delay(1);
	  }

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  if (hi2s->Instance == SPI2) {
    pdm_input_buffer_idx = 0;
  }
}

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  if (hi2s->Instance == SPI2) {
    pdm_input_buffer_idx = 1;
  }
}

// Callback de interrupción GPIO para cambio de método PSD
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  uint32_t current_time = HAL_GetTick();
  
  // Debounce del botón (evitar múltiples activaciones)
  if (GPIO_Pin == METHOD_SWITCH_GPIO_PIN && 
      (current_time - button_debounce_time) > 200) { // 200ms de debounce
    
    button_debounce_time = current_time;
    toggle_psd_method();
  }
}


void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
  // Callback para transmisión UART completa (si es necesario)
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
